In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series([0,1,2], index= ['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [5]:
ser2 = Series([3,4,5,6], index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [6]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [12]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [16]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ABC'),index=['SF','NYC','LA'])
dframe2

     A  B  C
SF   0  1  2
NYC  3  4  5
LA   6  7  8

In [17]:
dframe1 + dframe2

       A     B   C
LA   8.0  10.0 NaN
NYC  3.0   5.0 NaN
SF   NaN   NaN NaN

In [18]:
dframe1.add(dframe2,fill_value=0)

       A     B    C
LA   8.0  10.0  8.0
NYC  3.0   5.0  5.0
SF   0.0   1.0  2.0

In [25]:
ser3=dframe2.loc['NYC']
ser3

A    3
B    4
C    5
Name: NYC, dtype: int32

In [26]:
dframe2-ser1

     A  B  C
SF   0  0  0
NYC  3  3  3
LA   6  6  6